package me.injin.javatokotlin.chapter01

class Lec04

fun main() {
    /**
     * 단항 연산자
     *   ++, --
     * 산술 연산자
     *   +, -, *, /, %
     * 산술대입 연산자
     *   +=, -=, *=, /=, %=
     */

    /**
     * 비교 연산자와 동등성, 동일성
     *   >, <, >=, <=
     *   자바와 다르게 객체를 비교할때 비교 연산자를 사용하면 자동으로 compareTo 를 호출해 준다.
     * 동등성(Equality): 두 객체의 값이 같은가?
     *   코틀린 => ==
     * 동일성(Identity): 완전한 동일한 객체인가? => 주소가 같은가?
     *   코틀린 => ===
     * in / !in
     *   컬렉션이나 범위에 포함되어 있다, 포함되어 있지 않다
     * a..b
     *  a 부터 b 까지의 범위 객체를 생성한다
     */

}

